daily-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>jmn daily notes</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">jmn daily notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3446103">2022-11-09 Wednesday</a>
<ul>
<li><a href="#org47ffed0">Meta fires 11 000 people</a></li>
</ul>
</li>
<li><a href="#org07b0506">2022-11-08 Tuesday</a>
<ul>
<li><a href="#org8e258c5">Molly White talk</a></li>
<li><a href="#org3c758ed">CPUs: Speculative execution</a></li>
<li><a href="#org7b0b6d9">HMR for Remix dev experience with Vite</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3446103" class="outline-2">
<h2 id="org3446103">2022-11-09 Wednesday</h2>
<div class="outline-text-2" id="text-org3446103">
</div>
<div id="outline-container-org47ffed0" class="outline-3">
<h3 id="org47ffed0">Meta fires 11 000 people</h3>
<div class="outline-text-3" id="text-org47ffed0">
<ul class="org-ul">
<li><a href="https://about.fb.com/news/2022/11/mark-zuckerberg-layoff-message-to-employees/">https://about.fb.com/news/2022/11/mark-zuckerberg-layoff-message-to-employees/</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org07b0506" class="outline-2">
<h2 id="org07b0506">2022-11-08 Tuesday</h2>
<div class="outline-text-2" id="text-org07b0506">
</div>
<div id="outline-container-org8e258c5" class="outline-3">
<h3 id="org8e258c5">Molly White talk</h3>
<div class="outline-text-3" id="text-org8e258c5">
<p>
Is Web3 bullshit?
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=AGsllEF7w_g">https://www.youtube.com/watch?v=AGsllEF7w_g</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3c758ed" class="outline-3">
<h3 id="org3c758ed">CPUs: Speculative execution</h3>
<div class="outline-text-3" id="text-org3c758ed">
<p>
"Speculative execution is an optimization technique in which a processor (CPU)
performs a series of tasks before it is prompted to, in order to have the
information ready if it is required at any point."
</p>
<ul class="org-ul">
<li><a href="https://www.techtarget.com/whatis/definition/speculative-execution">https://www.techtarget.com/whatis/definition/speculative-execution</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7b0b6d9" class="outline-3">
<h3 id="org7b0b6d9">HMR for Remix dev experience with Vite</h3>
<div class="outline-text-3" id="text-org7b0b6d9">
<ul class="org-ul">
<li><a href="https://github.com/sudomf/remix-vite">https://github.com/sudomf/remix-vite</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.50 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
</div>
</body>
</html>
